---
title: ExtrusionFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ExtrusionFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ExtrusionFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotDrawExtrusions { get; }` | `ExtrusionFailures.CannotDrawExtrusions` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawExtrusionsError { get; }` | `ExtrusionFailures.CannotDrawExtrusionsError` | FailureDefinitionId |
| `FailureDefinitionId ExtrusionTooThin { get; }` | `ExtrusionFailures.ExtrusionTooThin` | FailureDefinitionId |
| `FailureDefinitionId InvalidExtrusionCurveloop { get; }` | `ExtrusionFailures.InvalidExtrusionCurveloop` | FailureDefinitionId |
| `FailureDefinitionId InvalidExtrusionCurveloopError { get; }` | `ExtrusionFailures.InvalidExtrusionCurveloopError` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```